#pragma once
//==========================================
//
// File: EnumPlayer.h
//
// プレイヤー　情報　列挙型			ヘッダーファイル
//
// 2016/12/24
//						Author Shinya Ueba
//==========================================



/********************************************************************
*
*
* プレイヤー　の列挙型 ここから
*
*
********************************************************************/


//---------------------------------------------------------
// Enum Class: PLAYER_STATE { int }
//
// プレイヤー　の状態を列挙
//
//
//---------------------------------------------------------
enum class PLAYER_STATE :int
{
	IDLE_RIGHT		= 0,	//右待機状態
	IDLE_LEFT		= 1,	//左待機状態
	WALK_RIGHT		= 2,	//右歩行
	WALK_LEFT		= 3,	//左歩行
	ATTACK_RIGHT	= 4,	//右向き攻撃
	ATTACK_LEFT		= 5,	//左向き攻撃
	EQUIP_RIGHT		= 6,	//装備する		右向き
	EQUIP_LEFT		= 7,	//装備する		左向き
	UN_EQUIP_RIGHT	= 8,	//装備を外す	右向き	
	UN_EQUIP_LEFT	= 9,	//装備を外す	左向き
	GRASP_RIGHT		= 10,	//手を掴む　右向き
	GRASP_LEFT		= 11,	//手を掴む　左向き
};

//---------------------------------------------------------
// Enum Class: PLAYER_ANIMATION_STATE { int }
//
// プレイヤー　アニメーションの状態を列挙
//
//
//---------------------------------------------------------
enum class PLAYER_ANIMATION_STATE :int
{
	IDLE_RIGHT			= 0,	//右待機状態
	IDLE_LEFT			= 1,	//左待機状態
	WALK_RIGHT			= 2,	//右歩行
	WALK_LEFT			= 3,	//左歩行
	FIRST_ATTACK_RIGHT	= 4,	//右向き攻撃（１撃目）
	SECOND_ATTACK_RIGHT	= 5,	//右向き攻撃（２撃目）
	THURD_ATTACK_RIGHT	= 6,	//右向き攻撃（３撃目）
	FIRST_ATTACK_LEFT	= 7,	//左向き攻撃（１撃目）
	SECOND_ATTACK_LEFT	= 8,	//左向き攻撃（２撃目）
	THURD_ATTACK_LEFT	= 9,	//左向き攻撃（３撃目）
	EQUIP_RIGHT			= 10,	//装備する		右向き
	EQUIP_LEFT			= 11,	//装備する		左向き
	UN_EQUIP_RIGHT		= 12,	//装備を外す	右向き	
	UN_EQUIP_LEFT		= 13,	//装備を外す	左向き
	GRASP_RIGHT			= 14,	//手を掴む　右向き
	GRASP_LEFT			= 15,	//手を掴む　左向き
};

//---------------------------------------------------------
// Enum Class: PLAYER_ACTION_STATE { int }
//
// プレイヤー　アクションの状態を列挙
//
//
//---------------------------------------------------------
enum class PLAYER_ACTION_STATE :int
{
	IDLE = 0,//待機状態
	WANDERING = 1,
	//	CHASE = 2,
};

/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/
//EOF