#pragma once
//==========================================
//
// File: EnumEnemy.h
//
// 敵　情報　列挙型			ヘッダーファイル
//
// 2016/12/24
//						Author Shinya Ueba
//==========================================

//==========================================================================
// ターゲットの種類
//==========================================================================
enum class TARGET_TYPE :int {
	NONE,
	BOY,
	BOY_ONLY,
	GIRL,
	GIRL_ONLY,
	BOTH
};


/********************************************************************
*
*
* 敵　Maidead　の列挙型 ここから
*
*
********************************************************************/


//---------------------------------------------------------
// Enum Class: MAIDEAD_STATE { int }
//
// 敵　Maidead　の状態を列挙
//
//
//---------------------------------------------------------
enum class ENEMY_MAIDEAD_STATE :int
{
	IDLE = 0,//待機状態
	WANDERING = 1,
	CHASE = 2,
	UNDER_ATTACK = 3,	//攻撃を受けている状態
	DEAD = 4,			//死亡状態
};

//---------------------------------------------------------
// Enum Class: MAIDEAD_STATE { int }
//
// 敵　Maidead　の移動状態を列挙
//
//
//---------------------------------------------------------
enum class ENEMY_MAIDEAD_MOVE_STATE : int
{
	WANDERING = 0,	//徘徊状態
};

enum class ENEMY_MAIDEAD_ANIMATION_STATE :int
{
	IDLE = 0,//待機状態
	WANDERING = 1,
	CHASE = 2,
	DAED = 2,
};

enum class ENEMY_MAIDEAD_ACTION_STATE :int
{
	IDLE = 0,//待機状態
	WANDERING = 1,
	CHASE = 2,
	UNDER_ATTACK = 3,//攻撃受けた
};





/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/



/********************************************************************
*
*
* 敵　Bat　の列挙型 ここから
*
*
********************************************************************/


//---------------------------------------------------------
// Enum Class: MAIDEAD_STATE { int }
//
// 敵　Maidead　の状態を列挙
//
//
//---------------------------------------------------------
enum class ENEMY_BAT_STATE :int
{
	IDLE = 0,//待機状態
//	WANDERING = 1,
//	CHASE = 2,
};

//---------------------------------------------------------
// Enum Class: BAT_STATE { int }
//
// 敵　Maidead　の移動状態を列挙
//
//
//---------------------------------------------------------
enum class ENEMY_BAT_MOVE_STATE : int
{
//	WANDERING = 0,	//徘徊状態
};

enum class ENEMY_BAT_ANIMATION_STATE :int
{
	IDLE = 0,//待機状態
//	WANDERING = 1,
	//	CHASE = 2,
};

enum class ENEMY_BAT_ACTION_STATE :int
{
	IDLE = 0,//待機状態
//	WANDERING = 1,
	//	CHASE = 2,
};





/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/
