#pragma once
//==========================================
//
// File: EnumPlayer.h
//
// プレイヤー　情報　列挙型			ヘッダーファイル
//
// 2016/12/24
//						Author Shinya Ueba
//==========================================



/********************************************************************
*
*
* プレイヤー　の列挙型 ここから
*
*
********************************************************************/

//---------------------------------------------------------
// Enum Class: PLAYER_AND_GIRL_STATE { int }
//
// プレイヤー　と　少女　の状態を列挙
//
//
//---------------------------------------------------------
enum class PLAYER_AND_GIRL_STATE :int
{
	FREE				= 10000,	//少女となにもしていない状態
	GRAPS_HANDS			= 20000,	//少女と手を握っている状態
	HOLD_THE_PRINCESS	= 30000,	//少女をお姫様抱っこしている状態

};

//---------------------------------------------------------
// Enum Class: PLAYER_DIRECTION_STATE { int }
//
// プレイヤーの向いている方向の状態を列挙
//
//
//---------------------------------------------------------
enum class PLATYER_DIRECTION_STATE :int
{
	RIGHT	= 100,	//右向き
	LEFT	= 200,	//左向き

};

//---------------------------------------------------------
// Enum Class: PLAYER_STATE { int }
//
// プレイヤー　の状態を列挙
//
//
//---------------------------------------------------------
enum class PLAYER_STATE :int
{
	IDLE			= 0,	//待機			
	WALK			= 1,	//歩行
	JUMP			= 2,	//ジャンプ
	FALL			= 3,	//落下
	ATTACK			= 4,	//攻撃
	JUMP_ATTACK		= 5,	//ジャンプ攻撃
	HIT_DAMAGE		= 6,	//ダメージを受けた
	EQUIP			= 7,	//装備
	GRASP			= 8,	//手を掴む・離す
	HOLD			= 9,	//お姫様抱っこ
};


/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/
//EOF