#pragma once
//==========================================
//
// File: EnumDamage.h
//
// 敵　情報　列挙型			ヘッダーファイル
//
// 2017/01/09
//						Author Shinya Ueba
//==========================================

/********************************************************************
*
*
* ダメージ Smoke　の列挙型 ここから
*
*
********************************************************************/


//---------------------------------------------------------
// Enum Class: SMOKE_STATE { int }
//
// ダメージ Smoke　の状態を列挙
//
//
//---------------------------------------------------------
enum class DAMAGE_SMOKE_STATE :int
{
	ATTACK = 0,			//攻撃状態
	DEAD = 1,			//死亡状態
};

enum class DAMAGE_SMOKE_ANIMATION_STATE :int
{
	ATTACK = 0,			//攻撃状態
	DEAD = 1,			//死亡状態
};

enum class DAMAGE_SMOKE_ACTION_STATE :int
{
	ATTACK = 0,			//攻撃状態
};

/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/

//EOF