#pragma once
//==========================================
//
// File: EnumGirl.h
//
// ガール　情報　列挙型			ヘッダーファイル
//
// 2016/12/28
//						Author Shinya Ueba
//==========================================



/********************************************************************
*
*
* ガール　の列挙型 ここから
*
*
********************************************************************/


//---------------------------------------------------------
// Enum Class: GIRL_STATE { int }
//
// ガール　の状態を列挙
//
//
//---------------------------------------------------------
enum class GIRL_STATE :int
{
	IDLE_RIGHT = 0,	//右待機状態
	IDLE_LEFT = 1,	//左待機状態
	WALK_RIGHT = 2,	//右歩行
	WALK_LEFT = 3,	//左歩行
	GRASP_RIGHT = 4,	//手を掴む　右向き
	GRASP_LEFT = 5,	//手を掴む　左向き
	GRASP_IDLE_RIGHT = 6,	//手を掴みながら待機　	右向き
	GRASP_IDLE_LEFT = 7,	//手を掴みながら待機	左向き
	GRASP_WALK_RIGHT = 8,	//手を掴みながら歩く　	右向き
	GRASP_WALK_LEFT = 9,	//手を掴みながら歩く	左向き
	HOLD_RIGHT		= 10,
	HOLD_LEFT		= 11,
};

//---------------------------------------------------------
// Enum Class: GIRL_ANIMATION_STATE { int }
//
// ガール　アニメーションの状態を列挙
//
//
//---------------------------------------------------------
enum class GIRL_ANIMATION_STATE :int
{
	IDLE_RIGHT = 0,	//右待機状態
	IDLE_LEFT = 1,	//左待機状態
	WALK_RIGHT = 2,	//右歩行
	WALK_LEFT = 3,	//左歩行
	GRASP_RIGHT = 4,	//手を掴む　右向き
	GRASP_LEFT = 5,	//手を掴む　左向き
};

//---------------------------------------------------------
// Enum Class: GIRL_ACTION_STATE { int }
//
// ガール　アクションの状態を列挙
//
//
//---------------------------------------------------------
enum class GIRL_ACTION_STATE :int
{
	IDLE = 0,//待機状態
	GRAPS_HAND = 1,
	HOLD_THE_PRINCESS	= 2,
	//	CHASE = 2,
};

/********************************************************************
*
*
* ここからまで
*
*
********************************************************************/
//EOF